/**************************************************************
# 문제 설명 
 정수 n이 입력으로 들어오면 1부터 n까지의 합을 구하시오.
 
# 입력 
 입력으로 자연수 n이 입력된다. 
# 출력 
 1부터 n까지의 합을 출력한다.
 
# 입력 예시 
 100 
# 출력 예시 
 5050 
# 도움말 
  
# 출처 
  

*************************************************************/
#include<stdio.h>
int main(){
	int i=0;
	int d=0;
	int num=0;
	scanf("%d",&d);
	for(i=0;i<=d;i++){
		num+=i;
	}
	printf("%d",num);
}

/**************************************************************
	문제번호: 1258
	아이디: ksunhokim
	사용언어: C++
	결과: 정확한 풀이
	수행 시간:0 ms
	메모리 사용량:1092 kb
****************************************************************/

