/**************************************************************
# 문제 설명 
 정수(integer) 두 개를 입력받아 그대로 출력해보자. 
# 입력 
 두 개의 정수가 공백으로 구분되어 입력된다. 
# 출력 
 입력받은 두 정수를 공백으로 구분하여 그대로 출력한다. 
# 입력 예시 
 1 2 
# 출력 예시 
 1 2 
# 도움말 
 int a, b;
scanf("%d %d", &a, &b);
printf("%d %d", a, b);
와 같은 방법으로 가능하다.
 
# 출처 
 정보컴퓨터교사 연구회/카페 (기초100제 v1.0) 

*************************************************************/
#include <iostream>
using namespace std;
int main()
{
    int a,b;
    cin>>a>>b;
    cout<<a<<" "<<b;
}

/**************************************************************
	문제번호: 1013
	아이디: ksunhokim
	사용언어: C++
	결과: 정확한 풀이
	수행 시간:0 ms
	메모리 사용량:1696 kb
****************************************************************/

