/**************************************************************
# 문제 설명 
 이번에는 공백이 들어있는 문장을 출력해보자.

다음 문장을 출력해보자.

Hello World

(대소문자에 주의한다.)
 
# 입력 
  
# 출력 
 Hello World 
# 입력 예시 
  
# 출력 예시 
 Hello World 
# 도움말 
 #include <stdio.h>
int main()
{
   printf("문장1 문장2");
   return 0;
}
​
을 실행시키면 "문장1" "문장2"가 공백을 사이에 두고 출력된다.
** 주의 : 본 화면에서 복사하여 붙여넣기하면 제대로 되지 않을 수 있으니 직접 소스코드를 작성해 넣어야한다. 
# 출처 
 정보컴퓨터교사 연구회/카페 (기초100제 v1.0) 

*************************************************************/
#include <iostream>
using namespace std;
int main()
{
	cout<<"Hello World";
}

/**************************************************************
	문제번호: 1002
	아이디: ksunhokim
	사용언어: C++
	결과: 정확한 풀이
	수행 시간:0 ms
	메모리 사용량:1692 kb
****************************************************************/

