/**************************************************************
# 문제 설명 
 키보드로 입력한 실수(소수점이 있는 수)를 그대로 출력하는 프로그램을 작성해보자. 
# 입력 
 소숫점이하가 6자리인 실수 한 개가 입력된다.
 
# 출력 
 입력된 실수를 그대로 출력한다.  
# 입력 예시 
 1.414000 
# 출력 예시 
 1.414000 
# 도움말 
 
 
# 출처 
 정보컴퓨터교사 연구회/카페 (기초100제 v1.0) 

*************************************************************/
#include <iostream>
using namespace std;
int main()
{
	double d;
	cin>>d;
	printf("%f",d);
}

/**************************************************************
	문제번호: 1012
	아이디: ksunhokim
	사용언어: C++
	결과: 정확한 풀이
	수행 시간:0 ms
	메모리 사용량:1696 kb
****************************************************************/

