/**************************************************************
# 문제 설명 
 문제1)
우리 나라는 가족 혹은 친척들 사이의 관계를 촌수라는 단위로 표현하는 독특한 문화를 가지고 있다. 이런한 촌수는 다음과 같은 방식으로 계산된다. 기본적으로 부모와 자식 사이를 1촌으로 정의하고 이로부터 사람들 간의 촌수를 계산한다. 예를 들면 나와 아버지, 아버지와 할아버지는 각각 1촌으로 나와 할아버지는 2촌이 되고, 아버지 형제들과 할아버지는 1촌, 나와 아버지 형제들과는 3촌이 된다.
여러 사람들에 대한 부모 자식들 간의 관계가 주어졌을 때, 주어진 두 사람의 촌수를 계산하는 프로그램을 작성하시오.
 
# 입력 
 사람들은 1, 2, 3, …, n (1≤n≤100)의 연속된 번호로 각각 표시된다.
첫째 줄에는 전체 사람의 수 n이 주어지고,
둘째 줄에는 촌수를 계산해야 하는 서로 다른 두 사람의 번호가 주어진다.
그리고 셋째 줄에는 부모 자식들 간의 관계의 개수 m이 주어진다.
넷째 줄부터는 부모 자식간의 관계를 나타내는 두 번호 x,y가 각 줄에 나온다.
이때 앞에 나오는 번호 x는 뒤에 나오는 정수 y의 부모 번호를 나타낸다. 
# 출력 
 입력에서 요구한 두 사람의 촌수를 나타내는 정수를 출력한다.
어떤 경우에는 두 사람같의 친척 관계가 전혀 없어 촌수를 계산할 수 없을 때가 있다. 이 때에는 -1을 출력해야 한다. 
# 입력 예시 
 9
7 3
7
1 2
1 3
2 7
2 8
2 9
4 5
4 6 
# 출력 예시 
 3 
# 도움말 
  
# 출처 
 1999 KOI 중등 

*************************************************************/
#include<iostream>
#include<vector>
#include<queue>
#include<map>
using namespace std;
map< int, vector<int> > graph;
int main()
{
    int n,m;
    int x,y;
    cin>>n;
    cin>>x>>y;
    cin>>m;
    for(int i=0;i<m;i++)
    {
        int g,j;
        cin>>g>>j;
        graph[g].push_back(j);
        graph[j].push_back(g);
    }
    queue<int> waiting;
    int dis[100000]={0};
    dis[x]=1;
    waiting.push(x);
    while(!waiting.empty())
    {
        int here=waiting.front(); waiting.pop();
        for(int i=0;i<graph[here].size();i++)
        {
            int there=graph[here][i];
            if(!dis[there])
            {
                dis[there]=dis[here]+1;
                waiting.push(there);
            }
            if(there==y)
            {
                cout<<dis[there]-1;
                return 0;
            }
        }
    }
    cout<<-1;
    return 0;
}

/**************************************************************
	문제번호: 4454
	아이디: ksunhokim
	사용언어: C++
	결과: 정확한 풀이
	수행 시간:0 ms
	메모리 사용량:1988 kb
****************************************************************/

