/**************************************************************
# 문제 설명 
 키보드로 입력한 문자를 그대로 출력하는 프로그램을 작성해보자. 
# 입력 
 문자 한 개가 입력된다. 
# 출력 
 입력된 문자를 그대로 출력한다. 
# 입력 예시 
 p 
# 출력 예시 
 p 
# 도움말 
  
# 출처 
 정보컴퓨터교사 연구회/카페 (기초100제 v1.0) 

*************************************************************/
#include <iostream>
using namespace std;
int main()
{
	char d;
	cin>>d;
	cout<<d;
}

/**************************************************************
	문제번호: 1011
	아이디: ksunhokim
	사용언어: C++
	결과: 정확한 풀이
	수행 시간:0 ms
	메모리 사용량:1696 kb
****************************************************************/

