/**************************************************************
# 문제 설명 
 C/C++언어에서 가장 기본적인 명령이 텍스트 출력이다.

printf( ) 를 이용해 다음 단어를 출력해보자.

Hello

(단, 글자색은 관계없다.)
 
# 입력 
  
# 출력 
 Hello
 
# 입력 예시 
  
# 출력 예시 
 Hello 
# 도움말 
 C/C++ IDE 프로그램을 설치한 후 아래와 같은 소스 코드를 작성하고 "컴파일-실행" 을 수행시키면, 지정한 "문장"이 출력된다.
#include <stdio.h>
int main()
{
 printf("문장"); 
 return 0;
}

** 주의 : 본 화면에서 복사하여 붙여넣기하면 제대로 되지 않을 수 있으니 직접 소스코드를 작성해 넣어야한다.
 
# 출처 
 정보컴퓨터교사 연구회/카페 (기초100제 v1.0) 

*************************************************************/
#include <iostream>
using namespace std;
int main()
{
	cout<<"Hello";
}
/**************************************************************
	문제번호: 1001
	아이디: ksunhokim
	사용언어: C++
	결과: 정확한 풀이
	수행 시간:0 ms
	메모리 사용량:1692 kb
****************************************************************/

