/**************************************************************
# 문제 설명 
 [문제 2]
정렬되지 않은 학생들의 임의의 점수를 입력하여 석차를 계산하는 프로그램을 작성하시오. 점수는 동점이 있을 수 있으며, 이러한 경우 같은 석차로 처리한다. 예를 들어 5명의 점수 100, 90, 76, 60, 90이 입력되었다면 석차는 2등이 2명이고 3등은 없다.  (단, 점수가 가장 높은 학생을 1등으로 한다.)
 
# 입력 
 1) 첫 번째 줄은 처리할 점수의 개수 n ( n <= 200 ) ※ 조건수정:2012.10.6
2) 두 번째 줄은 처리할 점수 데이터 (0~100점)
   (단, 각각의 점수는 빈칸으로 구별한다.)
 
# 출력 
 석차를 계산한 후 점수와 석차를  출력한다.
 
# 입력 예시 
 10
60 34 55 100 90 76 60 90 80 87 
# 출력 예시 
 60 7
34 10
55 9
100 1
90 2
76 6
60 7
90 2
80 5
87 4 
# 도움말 
  
# 출처 
 2006 교원프로그래밍경진대회 

*************************************************************/
#include <iostream>

using namespace std;

int main()
{
    int arr[200],ranks[200]={0};
    int size;
    cin>>size;
    for(int i=0;i<size;i++)
    {
        cin>>arr[i];
    }
    for(int i=0;i<size;i++)
    {
        for(int j=0;j<size;j++)
        {
            if(arr[i]<arr[j])
            {
                ranks[i]++;
            }
        }
    }
    for(int i=0;i<size;i++)
    {
        cout<<arr[i]<<" "<<ranks[i]+1<<endl;
    }
}

/**************************************************************
	문제번호: 4012
	아이디: ksunhokim
	사용언어: C++
	결과: 정확한 풀이
	수행 시간:0 ms
	메모리 사용량:1696 kb
****************************************************************/

